["EMPLOYMENT AGREEMENT \nThis Employment Agreement (“ Agreement”) is executed on 20th August, 2025 (“Execution \nDate”): \nBETWEEN \nBrightCode Technologies Private Limited, a company incorporated under the Companies \nAct, 2013, having its registered office at 501, Shree Business Tower, Ashram Road, \nAhmedabad – 380009, Gujarat, India (hereinafter referred to as the “Company”, which \nexpression shall, unless it be repugnant to the context or meaning thereof, be deemed to \nmean and include its successors and permitted assigns) of the FIRST PART; AND \nMs. Neha Patel, daughter of Mr. Rajesh Patel, residing at B-204, Shantiniketan Apartments, \nSatellite, Ahmedabad – 380015, Gujarat, India (hereinafter referred to as the “Employee” \nwhich expression shall, unless it be repugnant or contrary to the context thereof, mean \nand include her heirs, legal representatives, successors and permitted assigns) of the \nSECOND PART. The Company and the Employee shall hereinafter be individually referred to as “Party” and \ncollectively as “Parties”. WHEREAS: \nA. The Company is engaged in the business of Software Development and IT Consulting \nServices. B.", "yee shall hereinafter be individually referred to as “Party” and \ncollectively as “Parties”. WHEREAS: \nA. The Company is engaged in the business of Software Development and IT Consulting \nServices. B. The Company recognizes that the Employee has the requisite skill set to be employed as \na Senior Software Engineer. C. The Company wishes to retain the Employee’s services and the Employee wishes to \nprovide such services. D. The Parties intend to record the terms of employment under this Agreement. 1. DEFINITIONS \n(All standard definitions from the template shall apply, including references to Act, \nAffiliate, Business, Cause, Competitor, Confidential Information, Intellectual Property, \nPerson, Proprietary Information, etc.) 2. EMPLOYMENT 2.1 The Company has employed the Employee as Senior Software Engineer effective from 1st September, 2025 (“Effective Date”). 2.2 The Employee represents that she is free to enter into this Agreement and not bound by \nany restrictive covenants with any former employer. 3. PLACE OF WORK \nThe principal place of work shall be the Company’s office at Ahmedabad, Gujarat.", "ee to enter into this Agreement and not bound by \nany restrictive covenants with any former employer. 3. PLACE OF WORK \nThe principal place of work shall be the Company’s office at Ahmedabad, Gujarat. The \nEmployee may be required to travel within India or abroad for official assignments. 4. DUTIES AND OBLIGATIONS \n• The Employee shall devote full time and attention to her duties. \n• The Employee shall comply with all Company policies and maintain discipline. \n• The Employee shall not work for any competitor during employment. \n• Any representation before Government or signing of contracts shall be done only \nwith prior written approval of the Company’s Board of Directors. 5. REMUNERATION AND BENEFITS 5.1 The Employee shall receive an annual CTC of ₹9,00,000 (Nine Lakhs only), payable \nmonthly as per Company policy. 5.2 Reimbursement of travel, internet, and business expenses shall be provided on \nsubmission of valid bills. 5.3 Deductions towards income tax, PF, and other statutory deductions shall apply. 5.4 The Employee shall be entitled to 18 days of paid leave annually, along with gazetted \nholidays as per Company policy. 6.", "ctions towards income tax, PF, and other statutory deductions shall apply. 5.4 The Employee shall be entitled to 18 days of paid leave annually, along with gazetted \nholidays as per Company policy. 6. RECEIPT OF PAYMENTS FROM THIRD PARTIES \nThe Employee shall not receive or accept any commission, rebate, or benefit from third \nparties in relation to Company business. 7. INTELLECTUAL PROPERTY RIGHTS \nAll intellectual property, code, designs, or ideas developed during the course of \nemployment shall remain the sole property of the Company. 8. NON-COMPETE AND NON-SOLICIT \n• The Employee shall not join or assist a competitor during employment. \n• The Employee shall not solicit clients or employees of the Company during \nemployment and for one (1) year post-employment. 9. CONFIDENTIALITY \nThe Employee shall execute a separate Confidentiality and Intellectual Property \nAssignment Agreement and abide by its terms. 10. REMEDIES \nBreach of confidentiality, intellectual property, or non-compete obligations shall entitle \nthe Company to injunctive relief and damages under Indian law. 11.", "ent and abide by its terms. 10. REMEDIES \nBreach of confidentiality, intellectual property, or non-compete obligations shall entitle \nthe Company to injunctive relief and damages under Indian law. 11. TERMINATION \n• The Company may terminate the Employee with 2 months’ written notice or 2 \nmonths’ salary in lieu thereof. \n• The Employee may resign by giving 2 months’ written notice. \n• Upon termination, the Employee shall return all Company property including \nlaptop, ID card, and documents. 12. NOTICES \nIf to the Company: \nBrightCode Technologies Pvt. Ltd. 501, Shree Business Tower, Ashram Road, Ahmedabad – 380009 \nAttn: HR Department \nEmail: hr@brightcode.in \nIf to the Employee: \nMs. Neha Patel \nB-204, Shantiniketan Apartments, Satellite, Ahmedabad – 380015 \nEmail: neha.patel27@gmail.com 13. MISCELLANEOUS \n• This Agreement shall be governed by and construed in accordance with the laws of \nIndia. \n• Jurisdiction: Courts of Ahmedabad, Gujarat. \n• This Agreement constitutes the entire agreement between the Parties.", "reement shall be governed by and construed in accordance with the laws of \nIndia. \n• Jurisdiction: Courts of Ahmedabad, Gujarat. \n• This Agreement constitutes the entire agreement between the Parties. ANNEXURE – REMUNERATION \n• Annual CTC: ₹9,00,000/- \n• Basic Pay: ₹4,50,000/- \n• HRA: ₹1,80,000/- \n• Special Allowance: ₹1,50,000/- \n• Provident Fund: ₹72,000/- \n• Medical Insurance (Company Provided): ₹48,000/- \n \nSIGNATURES \nFor BrightCode Technologies Pvt. Ltd. Sd/- Mr. Arvind Joshi \n(Managing Director) \nEmployee: \nSd/- Ms. Neha Patel \nWitnesses: 1. Mr. Rakesh Mehta, Ahmedabad 2. Ms. Pooja Desai, Ahmedabad"]