["EMPLOYMENT AGREEMENT \nThis EMPLOYMENT AGREEMENT made in Jaipur, Rajasthan on this 20th day of August, 2025 \nBetween \nTechSolutions Private Limited, (hereinafter referred to as the “Employer”), having its \nregistered office at Plot No. 112, Malviya Nagar Industrial Area, Jaipur – 302017, Rajasthan, \nIndia \nAND \nMr. Rohan Sharma, S/o Mr. Anil Sharma, residing at C-45, Vaishali Nagar, Jaipur – 302021, \nRajasthan, India, hereinafter referred to as the “Employee”. \n(The Company and the Employee are hereinafter jointly referred to as the “Parties” and \nindividually as a “Party”). 1. DESIGNATION \nThe Employee is hereby appointed and shall hold office as Software Developer of the \nCompany on the terms and conditions contained hereunder. 2. PROBATIONARY PERIOD \nThe probationary period will be of six (6) months and the Company will evaluate the new hire’s \nqualifications, skills, and \"fit\" within the Company. During this time, the Company may \nterminate the working relationship without cause with advance notice, except as prescribed by \nlaw. Upon satisfactory completion, the Employee will achieve regular employee status. 3. PLACE OF WORK", "y \nterminate the working relationship without cause with advance notice, except as prescribed by \nlaw. Upon satisfactory completion, the Employee will achieve regular employee status. 3. PLACE OF WORK 3.1 The Employee will be stationed at the Employer’s office in Jaipur, Rajasthan, but may be \ntransferred to any of the branches or project sites across India. 3.2 The Employee may also be required to work at client premises from time to time. \n \n(Director) \nFor TechSolutions Private Limited \n(Employee) \nRohan Sharma 4. DUTIES AND POWERS 4.1 The Employee shall devote his efforts and full business time and attention to the \nperformance of such duties as assigned. 4.2 The Employee shall maintain proper dignity of the Company’s office. 4.3 As Software Developer, the Employee shall adhere to all applicable laws and Company \npolicies. 4.4 The Employee shall faithfully and diligently perform duties and report to his immediate \nmanager. 4.5 The Employee shall not sign or commit on behalf of the Company without consent. 4.6 The Employee shall follow all Company rules, regulations, and modifications as applicable. 4.7 Any disputes shall be referred to arbitration of a sole arbitrator, Mr.", "the Company without consent. 4.6 The Employee shall follow all Company rules, regulations, and modifications as applicable. 4.7 Any disputes shall be referred to arbitration of a sole arbitrator, Mr. Suresh Mehta, \nAdvocate, under the Arbitration and Conciliation Act, 1996, seated in Jaipur, in Hindi \nlanguage. 5. ANNUAL BASE SALARY \nThe Employee shall be entitled to a salary of ₹6,00,000 (Six Lakhs Only) CTC per annum, \npayable as per Company’s payroll policy. 6. CONFIDENTIALITY \nThe Employee shall not disclose, during or after employment, any confidential information, \ntrade secrets, or client data of the Company. All intellectual property created during \nemployment shall be the exclusive property of the Company. 7. NON-COMPETE CLAUSE \nThe Employee shall not start or work in a similar business competing with the Company for a \nperiod of three (3) years after termination. Any violation shall make the Employee liable under Section 73 & 74 of the Indian Contract Act, 1872. 8. TERM OF CONTRACT, TERMINATION, AND SEVERANCE PAY \n• This Agreement shall continue until terminated by either Party. \n• Employee may resign with one month written notice.", "Indian Contract Act, 1872. 8. TERM OF CONTRACT, TERMINATION, AND SEVERANCE PAY \n• This Agreement shall continue until terminated by either Party. \n• Employee may resign with one month written notice. Early resignation before two (2) \nyears will attract a penalty of ₹2,00,000 (Two Lakhs). \n• Employer reserves the right to terminate without notice for misconduct or breach of \ncontract. \n• If Employee leaves within 6 months of training, training expenses will be recovered. 9. OTHER TERMS OF EMPLOYMENT \nThe Employee shall follow all rules as per the Company’s Employee Guidelines, which may be \nmodified from time to time. 10. MISCELLANEOUS \nThis Agreement supersedes all prior arrangements and may be modified only with written \nmutual consent. 11. JURISDICTION \nThis Agreement shall be governed by the laws of Jaipur, Rajasthan (India). IN WITNESS WHEREOF \nThe Parties hereto have hereunto set and subscribed their respective hands the day and year \nfirst hereinabove written. Employer: \nFor TechSolutions Pvt. Ltd. Sd/- Mr. Amit Verma \n(Director) \nEmployee: \nSd/- Mr. Rohan Sharma \nWitnesses: 1. Mr. Sunil Gupta, Jaipur 2. Ms. Priya Mehta, Jaipur"]