["COMMERCIAL LEASE AGREEMENT \nThis Commercial Lease Agreement (hereinafter referred as the “ Agreement”) is executed \nat Bengaluru, Karnataka on this 23rd day of August, 2025 (“Effective Date”). BY AND BETWEEN \nMr. Suresh Kumar Iyer, son of Mr. Raghunath Iyer, aged 55 years, residing at Flat No. 502, \nPrestige Lake View Apartments, Whitefield, Bengaluru – 560066, Karnataka, India \n(hereinafter referred to as the “LESSOR”), which expression shall unless repugnant to the \ncontext or meaning thereof mean and include his heirs, successors, legal representatives, \nadministrators and assigns of the FIRST PART; AND \nMr. Abhishek Reddy, son of Mr. Pratap Reddy, aged 32 years, residing at House No. 45, \nGreen Valley Layout, HSR Layout, Bengaluru – 560102, Karnataka, India (hereinafter \nreferred to as the “LESSEE”), which expression shall unless repugnant to the context or \nmeaning thereof mean and include his heirs, successors, legal representatives, \nadministrators and assigns of the SECOND PART.", "the “LESSEE”), which expression shall unless repugnant to the context or \nmeaning thereof mean and include his heirs, successors, legal representatives, \nadministrators and assigns of the SECOND PART. RECITALS \nWHEREAS, the Lessor is the sole and absolute owner of the commercial premises bearing \nShop No. 7, Ground Floor, Orion Business Park, Outer Ring Road, Bengaluru – 560037, \nadmeasuring 750 sq. ft. along with common amenities (hereinafter referred to as the \n“Demised Premises”). WHEREAS, the Lessor has agreed to lease the Demised Premises to the Lessee, and the \nLessee has agreed to accept the lease subject to the terms, conditions and stipulations \ncontained herein. TERMS & CONDITIONS 1. LEASE TERM \no The lease shall be for a fixed period of 11 months commencing from 1st \nSeptember, 2025 and ending on 31st July, 2026, unless terminated earlier \nunder this Agreement. 2.", "& CONDITIONS 1. LEASE TERM \no The lease shall be for a fixed period of 11 months commencing from 1st \nSeptember, 2025 and ending on 31st July, 2026, unless terminated earlier \nunder this Agreement. 2. MONTHLY RENT \no The Lessee agrees to pay a monthly rent of ₹45,000/- (Rupees Forty-Five \nThousand only). \no Rent shall be payable on or before the 5th day of every English calendar \nmonth in advance by bank transfer to the Lessor’s account: \n▪ Account Name: Suresh Kumar Iyer \n▪ Bank: HDFC Bank, Whitefield Branch \n▪ Account No.: 1234567890 \n▪ IFSC: HDFC0000123 3. SECURITY DEPOSIT \no The Lessee shall deposit a sum of ₹1,50,000/- (Rupees One Lakh Fifty \nThousand only) as refundable security deposit at the time of signing this Agreement. \no The deposit shall be refunded within 15 days from the date of vacation of the \npremises, subject to deductions for damages, unpaid rent, or other dues. 4. USE OF PREMISES \no The Demised Premises shall be used only for office/commercial purposes \nand not for residential or illegal purposes. \no Sub-letting, transfer or parting with possession without written consent of \nthe Lessor is strictly prohibited. 5.", "only for office/commercial purposes \nand not for residential or illegal purposes. \no Sub-letting, transfer or parting with possession without written consent of \nthe Lessor is strictly prohibited. 5. LATE PAYMENT & CHEQUE DISHONOUR \no Delay in payment beyond the 5th day of the month shall attract a penalty of \n₹1,000 per month. \no Cheque dishonour shall attract a penalty of ₹750/- per instance. 6. MAINTENANCE & UTILITIES \no The Lessee shall pay electricity, water, internet, housekeeping and \nmaintenance charges directly to concerned authorities/society. \no The Lessor shall be responsible for property tax and structural repairs of the \nbuilding. \no The Lessee shall be responsible for day-to-day minor repairs and \ncleanliness. 7. ALTERATIONS & FIXTURES \no The Lessee shall not make structural changes without prior written consent. \no Temporary partitions, furniture, and fixtures may be installed but must be \nremoved at the end of the lease, restoring the premises to its original \ncondition. 8. INSPECTION RIGHTS \no The Lessor reserves the right to enter the premises for inspection during \nreasonable business hours after giving 24 hours’ notice. 9.", "the premises to its original \ncondition. 8. INSPECTION RIGHTS \no The Lessor reserves the right to enter the premises for inspection during \nreasonable business hours after giving 24 hours’ notice. 9. INDEMNITY \no The Lessee shall indemnify and keep indemnified the Lessor against all \nlosses, damages, legal costs, penalties or liabilities arising due to Lessee’s \nuse of the premises. 10. FORCE MAJEURE \no Neither party shall be held liable for non-performance due to events beyond \ntheir control such as natural calamities, fire, flood, earthquake, epidemic, \nlockdown, strike, government restrictions, or war. 11. TERMINATION \no Either party may terminate this lease by giving 30 days’ prior written notice. \no If the Lessee fails to vacate upon termination, he shall be liable to pay \ndouble the monthly rent until the premises are vacated. 12. RENEWAL/EXTENSION \no On expiry, the lease may be renewed by mutual consent with revised rent \nand terms through execution of a fresh agreement. 13.", "the monthly rent until the premises are vacated. 12. RENEWAL/EXTENSION \no On expiry, the lease may be renewed by mutual consent with revised rent \nand terms through execution of a fresh agreement. 13. DISPUTE RESOLUTION & ARBITRATION \no In case of disputes, parties shall first attempt amicable settlement. \no Failing which, disputes shall be referred to sole arbitrator appointed \nmutually in accordance with the Arbitration and Conciliation Act, 1996. \no The place of arbitration shall be Bengaluru, and the language shall be \nEnglish. 14. STAMP DUTY & REGISTRATION \no The Agreement shall be executed on a stamp paper of appropriate value as \nper the Karnataka Stamp Act, 1957. \no The Agreement shall be registered with the jurisdictional Sub-Registrar, \nBengaluru, and the cost of stamp duty and registration shall be borne \nequally by the Lessor and Lessee. 15. APPLICABLE LAW & JURISDICTION \no This Agreement shall be governed by and construed in accordance with the \nlaws of India. \no Courts at Bengaluru, Karnataka shall have exclusive jurisdiction over all \ndisputes arising hereunder. SIGNATURES \nIN WITNESS WHEREOF, the parties hereto have executed this", "with the \nlaws of India. \no Courts at Bengaluru, Karnataka shall have exclusive jurisdiction over all \ndisputes arising hereunder. SIGNATURES \nIN WITNESS WHEREOF, the parties hereto have executed this Agreement on the date first \nabove written. LESSOR \n \nMr. Suresh Kumar Iyer \nLESSEE \n \nMr. Abhishek Reddy \nWitnesses: 1. _________________________ (Name, Address, Signature) 2. _________________________ (Name, Address, Signature) \n \nANNEXURE – I \nFurniture/Fixtures Provided \n• 2 Office Tables \n• 6 Office Chairs \n• 1 Air Conditioner (Split AC, 1.5 Ton) \n• 1 Ceiling Fan \n• 1 Electrical Inverter with Battery Backup"]