["Community Services InternshipMridung Ghai|RollNo. 24BCH039Chemical Engineering, Semester2\nAcknowledgementMy heart felt thanks to Arpita Shah maam for her guidance, empathy, and profound expertise in malnutrition, crucial for my internship at CJ SHAH FOUNDATION.The welcoming environment at the Gaushala and the warmth of every team member made this experience enriching and memorable. I am grateful to all who contributed. Organization DetailsName:CJ SHAH FOUNDATION Contact Person:Amisha Shah Address:11, Yantrika Society, Nr: Chanakyapuri, new sama road, Vadodara PIN:390024 Telephone:9825027739\nInternship OverviewThis report details my 21-dayinternshipatthe CJ Shah Foundation, an NGO Dedicated to improving the lives of underprivileged children through education and care. I worked with pre-primary students, engaging them in academic and recreational activities to enhance their learning and social development.", "ives of underprivileged children through education and care. I worked with pre-primary students, engaging them in academic and recreational activities to enhance their learning and social development. Internship Objectives2 3Nurturing Environment Overall DevelopmentAssisting the early education of pre- primary students.Foster a joyful  environment through playful learning.Support young children’s development in daily routines.Early Education1\nRoles and ResponsibilitiesTeaching Basic Concepts:Taught English alphabet, numbers, colors, and shapes.Activity-Based Learning:Conducted drawing, storytelling, rhymes, and hopscotch. Feeding Assistance:Helped children eat, ensuring hygiene. Classroom Support:Maintained discipline and assisted the main teacher. Emotional Engagement:Bonded with children, ensuring they felt safe and heard.", "g Assistance:Helped children eat, ensuring hygiene. Classroom Support:Maintained discipline and assisted the main teacher. Emotional Engagement:Bonded with children, ensuring they felt safe and heard. Key Activities ConductedDay(s)1-56-1011-1516-2021\nActivityAlphabet introduction with flashcards, rhymes, and storytelling Outdoor games, group play, and creative drawing sessions Practicing letter sounds, group singing, and snack time help Review games, fun quizzes, and teaching through play Final day activities, reflection, and photo session\nSkills DevelopedTeamworkCommunicationCreativityPatience & EmpathyCollaborated with teachers and staff.Improved interaction with young children.Designed engaging teaching methods with limited resources.Learned to understand and respond to unique needs. Challenges FacedManaging young children’s attention spans required consistent energy and  creativity.Adapting communication for children with diverse learning speeds and backgrounds. Maintaining balance between fun and discipline in a joyful environment.", "ans required consistent energy and  creativity.Adapting communication for children with diverse learning speeds and backgrounds. Maintaining balance between fun and discipline in a joyful environment. ConclusionMy 21-day internship at CJ Shah Foundation was a highly enriching and heartwarming experience, offering valuable insights into early childhood education and NGO operations. I am grateful for the opportunity to contribute to these young children's learning journey and for my personal growth.Sincerely, Mridung Ghai."]